// # დავალება: სესხის გამოთვლა Control Flow-ებით

// ## აღწერა
// დაწერე პროგრამა, რომელიც მომხმარებელს სთხოვს:
// - სახელს
// - გვარს
// - ასაკს

// შემდეგ პროგრამამ უნდა შეაფასოს **სესხის შესაძლებლობა** ასაკის მიხედვით.

// ---

// ## მოთხოვნები

// 1. მომხმარებელმა უნდა შეიყვანოს **სახელი**, **გვარი** და **ასაკი**.  
//    - თუ სახელი ან გვარი ცარიელია → დაბეჭდე:  
//      _"სახელი და გვარი აუცილებელია!"_

// 2. **ასაკის მიხედვით სესხის შესაძლებლობა:**
//    - თუ ასაკი **18-ზე ნაკლებია** →  
//      დაბეჭდე: _"თქვენ არასრულწლოვანი ხართ და სესხს ვერ მიიღებთ."_

//    - თუ ასაკი **18-დან 25 წლამდეა** →  
//      - თუ გვარი მთავრდება `"იძე"`-ზე →  
//        დაბეჭდე: _"თქვენ ახალგაზრდა ხართ, შეგიძლიათ აიღოთ სესხი 5000 ₾-მდე, სპეციალური პირობებით."_
//      - სხვა შემთხვევაში →  
//        დაბეჭდე: _"თქვენ შეგიძლიათ აიღოთ სესხი 3000 ₾-მდე."_

//    - თუ ასაკი **26-დან 40 წლამდეა** →  
//      - თუ სახელი იწყება `"გ"`-ზე →  
//        დაბეჭდე: _"თქვენ შეგიძლიათ აიღოთ სესხი 20,000 ₾-მდე."_
//      - სხვა შემთხვევაში →  
//        დაბეჭდე: _"თქვენ შეგიძლიათ აიღოთ სესხი 15,000 ₾-მდე."_

//    - თუ ასაკი **41-დან 65 წლამდეა** →  
//      - თუ გვარი მთავრდება `"შვილი"`-ზე და ასაკი < 50 →  
//        დაბეჭდე: _"თქვენ შეგიძლიათ აიღოთ სესხი 30,000 ₾-მდე განსაკუთრებული პირობებით."_
//      - სხვა შემთხვევაში →  
//        დაბეჭდე: _"თქვენ შეგიძლიათ აიღოთ სესხი 25,000 ₾-მდე."_

//    - თუ ასაკი **65-ზე მეტია** →  
//      დაბეჭდე: _"თქვენ პენსიონერი ხართ და სესხს ვერ მიიღებთ."_

let firstName = prompt ("თქვენი სახელი");
let lastName = prompt ("თქვენი გვარი");
let age = Number (prompt("თქვენი ასაკი"));

if (!firstName || !lastName){
    alert ("სახელი და გვარი აუცილებელია!");
}else if (age < 18) {
 alert("თქვენ არასრულწლოვანი ხართ და სესხს ვერ მიიღებთ.");
}else if (age >= 18 && age <= 25) {
    if (lastName.endsWith("იძე")){
    alert("თქვენ ახალგაზრდა ხართ, შეგიძლიათ აიღოთ სესხი 5000 ₾-მდე, სპეციალური პირობებით.");
}else {
    alert ("თქვენ შეგიძლიათ აიღოთ სესხი 3000 ₾-მდე.");
}
}else if (age >= 26 && age <= 40){
    if (firstName.startsWith("გ")){
       alert ("თქვენ შეგიძლიათ აიღოთ სესხი 20,000 ₾-მდე.");
    }else {
        alert("თქვენ შეგიძლიათ აიღოთ სესხი 15,000 ₾-მდე.");
    }
}else if (age >= 41 && age <65)  {
    if (lastName.endsWith("შვილი") && age < 50) {
        alert("თქვენ შეგიძლიათ აიღოთ სესხი 30,000 ₾-მდე განსაკუთრებული პირობებით.");

    }else{
        alert("თქვენ შეგიძლიათ აიღოთ სესხი 25,000 ₾-მდე.")
    }
}else if (age >= 65) {
    alert("თქვენ პენსიონერი ხართ და სესხს ვერ მიიღებთ.")
}
