// # ციკლების სავარჯიშოები

// ## 1. რიცხვების დაბეჭდვა
// დაწერე პროგრამა, რომელიც დაბეჭდავს ყველა რიცხვს **1-დან 100-მდე**:
// - `for` ციკლით  
// - `while` ციკლით  

// ---

// ## 2. კენტი და ლუწი რიცხვები
// დაწერე პროგრამა, რომელიც **0-დან 50-მდე** რიცხვებში:
// - დაბეჭდავს მხოლოდ ლუწებს  
// - შემდეგ მხოლოდ კენტებს  

// ---

// ## 3. იპოვე ყველაზე დიდი რიცხვი მოცემული მასივიდან
// გაცემულია მასივი:  
// ```js
// const nums = [5, 12, 8, 130, 44];


// ---

// დავალება 1.

for (let i = 1; i <= 100; i++) {
  console.log(i);
}

let i = 1;
while (i <= 100) {
  console.log(i);
  i++;
}


// ---



// დავალება 2.

for (let i = 0; i <= 50; i++)
{
    if (i % 2 === 0){
    console.log(i);  
    }
}

for (let i = 1; i<=50; i++) {
    if (i % 2 === 1) {
        console.log(i);
        
    }
}



// ---


// დავალება 3.

const nums = [5, 12, 8, 130, 44];

let max = nums[0];

for (let i = 1; i < nums.length; i++){
    if(nums[i] > max){
        max = nums[i];
    }
}
console.log(max);
